# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [3]:
data = pd.DataFrame({"bedrs":[np.random.randint(1,4) for i in range(100)],
                     "bathrs":[np.random.randint(1,3) for i in range(100)],
                     "price_sqr_meter":[np.random.randint(10000,30000) for i in range(100)],
                    })
data.head()

   bedrs  bathrs  price_sqr_meter
0      2       1            10572
1      3       1            15085
2      1       1            18029
3      3       2            13005
4      3       2            23285

### Step 3. Let's create a DataFrame by joinning the Series by column

In [4]:
data

    bedrs  bathrs  price_sqr_meter
0       2       1            10572
1       3       1            15085
2       1       1            18029
3       3       2            13005
4       3       2            23285
..    ...     ...              ...
95      1       1            22661
96      1       1            11759
97      2       2            10040
98      3       2            28284
99      1       1            27296

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

### Step 6. Oops, it seems it is going only until index 99. Is it true?

### Step 7. Reindex the DataFrame so it goes from 0 to 299